### Terraform Plan Result

## Infrastructure (prod/infra)
```
tls_private_key.primary: Refreshing state... [id=483f06ce9559bc4f2bc651b6b6f94e8145eec011]
digitalocean_reserved_ip.primary: Refreshing state... [id=138.197.236.79]
digitalocean_ssh_key.primary: Refreshing state... [id=48420182]
digitalocean_vpc.k8s: Refreshing state... [id=7b2d2bbd-ac3c-4add-9822-78e1a684e467]
module.controlplane.digitalocean_droplet.control_plane: Refreshing state... [id=503316753]
module.controlplane.null_resource.wait_for_droplet: Refreshing state... [id=1046244744893547066]
module.controlplane.digitalocean_reserved_ip_assignment.public_ip: Refreshing state... [id=503316753-138.197.236.79-20250620065700828900000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.controlplane.data.remote_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "remote_file" "kubeconfig" {
      + content     = (known after apply)
      + group       = (known after apply)
      + group_name  = (known after apply)
      + id          = (known after apply)
      + owner       = (known after apply)
      + owner_name  = (known after apply)
      + path        = "/root/kubeconfig"
      + permissions = (known after apply)

      + conn {
          + host        = (known after apply)
          + private_key = (sensitive value)
          + user        = "root"
        }
    }

  # module.controlplane.digitalocean_droplet.control_plane must be replaced
-/+ resource "digitalocean_droplet" "control_plane" {
      ~ created_at           = "2025-06-20T06:52:35Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "503316753" -> (known after apply)
      ~ ipv4_address         = "134.209.59.133" -> (known after apply)
      ~ ipv4_address_private = "10.0.4.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "k8s-control-plane"
      ~ price_hourly         = 0.03571 -> (known after apply)
      ~ price_monthly        = 24 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "control-plane",
            "k8s",
        ]
      ~ urn                  = "do:droplet:503316753" -> (known after apply)
      ~ user_data            = "356b3f5d3cc98cd150941cc4433c95b6c3016ded" -> "bca3e6eda8abbb5790cd01ee602ee176a9d7fbe3" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.controlplane.digitalocean_reserved_ip_assignment.public_ip must be replaced
-/+ resource "digitalocean_reserved_ip_assignment" "public_ip" {
      ~ droplet_id = 503316753 -> (known after apply) # forces replacement
      ~ id         = "503316753-138.197.236.79-20250620065700828900000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.controlplane.null_resource.wait_for_droplet must be replaced
-/+ resource "null_resource" "wait_for_droplet" {
      ~ id       = "1046244744893547066" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "droplet_id"     = "503316753" -> (known after apply)
          ~ "droplet_ip"     = "134.209.59.133" -> (known after apply)
          ~ "droplet_status" = "active" -> (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ kubeconfig = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

## K8s (prod/k8s)
```
data.terraform_remote_state.infra: Reading...
module.database.kubernetes_namespace_v1.database: Refreshing state... [id=database]
module.database.kubernetes_secret_v1.postgres_database_secret: Refreshing state... [id=database/postgres-passwords]
module.certmanager.kubernetes_namespace_v1.cert_manager: Refreshing state... [id=cert-manager]
module.argocdsubdomain.data.cloudflare_zones.selected: Reading...
module.certmanager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
data.terraform_remote_state.infra: Read complete after 1s
module.certmanager.kubernetes_secret_v1.cloudflare_api_key: Refreshing state... [id=cert-manager/cloudflare-api-key]
module.certmanager.kubectl_manifest.cert_manager_cluster_issuer: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt]
module.argocdsubdomain.data.cloudflare_zones.selected: Read complete after 1s [name=haydenroszell.com]
module.argocdsubdomain.cloudflare_dns_record.domain: Refreshing state... [id=80bbdc96393ecb33566b3a449c31ce11]
module.argocd.kubernetes_namespace_v1.argocd: Refreshing state... [id=argo-cd]
module.argocd.tls_private_key.gitops: Refreshing state... [id=4c6a34d3b8cffb3091285b532891557fcbebdd1f]
module.argocd.github_repository_deploy_key.gitops: Refreshing state... [id=infra-gitops:125087821]
module.database.kubectl_manifest.argo_appproject: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/argo-cd/appprojects/database]
module.argocd.helm_release.argo_cd: Refreshing state... [id=argo-cd]
module.database.module.website_prod.kubectl_manifest.argo_application: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/database/applications/database]
module.argocd.kubernetes_secret.argo_repo: Refreshing state... [id=argo-cd/infra-gitops]
module.website.kubernetes_namespace_v1.prod: Refreshing state... [id=website-prod]
module.website.kubernetes_namespace_v1.staging: Refreshing state... [id=website-staging]
module.website.module.prod_domain.cloudflare_dns_record.domain: Refreshing state... [id=3c18dd50a136de982a1d1a58c3e473a6]
module.website.module.staging_domain.cloudflare_dns_record.domain: Refreshing state... [id=0b0786099f557d3d1204467623399520]
module.website.kubectl_manifest.argo_appproject: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/argo-cd/appprojects/website]
module.website.module.prod_www.cloudflare_dns_record.domain: Refreshing state... [id=a57f2c8ed3a85d8db7914442a264f3d4]
module.website.module.ghcr_pull_secret.kubernetes_secret_v1.ghcr: Refreshing state... [id=website-staging/regcred]
module.website.module.prod_ghcr_pull_secret.kubernetes_secret_v1.ghcr: Refreshing state... [id=website-prod/regcred]
module.website.module.website_staging.kubectl_manifest.argo_application: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/website-staging/applications/website-staging]
module.website.module.website_prod.kubectl_manifest.argo_application: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/website-prod/applications/website-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.certmanager.kubernetes_secret_v1.cloudflare_api_key will be updated in-place
  ~ resource "kubernetes_secret_v1" "cloudflare_api_key" {
      ~ data                           = (sensitive value)
        id                             = "cert-manager/cloudflare-api-key"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.module.prod_domain.data.cloudflare_zones.selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zones" "selected" {
      + match  = (known after apply)
      + name   = "haydenroszell.com"
      + result = (known after apply)
    }

  # module.website.module.prod_domain.cloudflare_dns_record.domain must be replaced
-/+ resource "cloudflare_dns_record" "domain" {
      ~ created_on  = "2025-09-21T22:55:57Z" -> (known after apply)
      ~ id          = "3c18dd50a136de982a1d1a58c3e473a6" -> (known after apply)
      ~ meta        = jsonencode({}) -> (known after apply)
      ~ modified_on = "2025-09-21T22:55:57Z" -> (known after apply)
        name        = "haydenroszell.com"
      ~ proxiable   = true -> (known after apply)
      ~ settings    = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags        = []
      ~ zone_id     = "ae2642f28110cc1d459376bc73924f1a" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.website.module.prod_www.data.cloudflare_zones.selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zones" "selected" {
      + match  = (known after apply)
      + name   = "haydenroszell.com"
      + result = (known after apply)
    }

  # module.website.module.prod_www.cloudflare_dns_record.domain must be replaced
-/+ resource "cloudflare_dns_record" "domain" {
      ~ created_on  = "2025-09-21T22:55:57Z" -> (known after apply)
      ~ id          = "a57f2c8ed3a85d8db7914442a264f3d4" -> (known after apply)
      ~ meta        = jsonencode({}) -> (known after apply)
      ~ modified_on = "2025-09-21T22:55:57Z" -> (known after apply)
        name        = "www.haydenroszell.com"
      ~ proxiable   = true -> (known after apply)
      ~ settings    = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags        = []
      ~ zone_id     = "ae2642f28110cc1d459376bc73924f1a" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.website.module.staging_domain.data.cloudflare_zones.selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zones" "selected" {
      + match  = (known after apply)
      + name   = "haydenroszell.com"
      + result = (known after apply)
    }

  # module.website.module.staging_domain.cloudflare_dns_record.domain must be replaced
-/+ resource "cloudflare_dns_record" "domain" {
      ~ created_on  = "2025-09-21T22:55:57Z" -> (known after apply)
      ~ id          = "0b0786099f557d3d1204467623399520" -> (known after apply)
      ~ meta        = jsonencode({}) -> (known after apply)
      ~ modified_on = "2025-09-21T22:55:57Z" -> (known after apply)
        name        = "stage.haydenroszell.com"
      ~ proxiable   = true -> (known after apply)
      ~ settings    = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags        = []
      ~ zone_id     = "ae2642f28110cc1d459376bc73924f1a" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Comment -->